{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"i1:0": {"name": "i1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "i3:0": {"name": "i3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "i2:0": {"name": "i2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"dans_ensemble_9": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "i1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "i2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "i3", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/stack", "op": "Pack", "input": ["i1", "i2", "i3"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/stack"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Shape", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/axes", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/GatherV2_1/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Shape", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/free", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/GatherV2_1", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/GatherV2", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Const_2", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/GatherV2", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/concat_1/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Prod_1", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Prod"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/stack", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Reshape", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Reshape_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/MatMul", "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot", "StatefulPartitionedCall/model_20/dans_ensemble_9/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_20/dans_ensemble_9/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Reshape", "shape": [1, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/Const_2", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_20/dans_ensemble_9/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}