{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_20", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "i1"}, "name": "i1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "i2"}, "name": "i2", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "i3"}, "name": "i3", "inbound_nodes": []}, {"class_name": "DansEnsemble", "config": {"name": "dans_ensemble_9", "trainable": true, "dtype": "float32", "activation": ["sigmoid"]}, "name": "dans_ensemble_9", "inbound_nodes": [[["i1", 0, 0, {}], ["i2", 0, 0, {}], ["i3", 0, 0, {}]]]}], "input_layers": [["i1", 0, 0], ["i2", 0, 0], ["i3", 0, 0]], "output_layers": [["dans_ensemble_9", 0, 0]]}}, "training_config": {"loss": "mse", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dans_ensemble_9/kernel", "shape": [3], "dtype": "float32"}, {"name": "dans_ensemble_9/bias", "shape": [1], "dtype": "float32"}]}]}